Revit 2027 API
BuiltInFailures.CopyPasteFailures.CannotCopyDependentView Property
 Dependent views cannot be copied.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCopyDependentView { get; }
Public Shared ReadOnly Property CannotCopyDependentView As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCopyDependentView {
	FailureDefinitionId^ get ();
}
static member CannotCopyDependentView : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace